package com.megahed.eqtarebmenalla.ui.home

import androidx.lifecycle.LiveData
import androidx.lifecycle.MutableLiveData
import androidx.lifecycle.ViewModel

class HomeViewModel : ViewModel() {

    private val _text = MutableLiveData<String>().apply {
        value = " ﷽\n" +
                "اقْرَأْ بِاسْمِ رَبِّكَ الَّذِي خَلَقَ " +
                " خَلَقَ الْإِنْسَانَ مِنْ عَلَقٍ " +
                " اقْرَأْ وَرَبُّكَ الْأَكْرَمُ " +
                " الَّذِي عَلَّمَ بِالْقَلَمِ " +
                " عَلَّمَ الْإِنْسَانَ مَا لَمْ يَعْلَمْ " +
                " كَلَّا إِنَّ الْإِنْسَانَ لَيَطْغَىٰ " +
                " أَنْ رَآهُ اسْتَغْنَىٰ " +
                " إِنَّ إِلَىٰ رَبِّكَ الرُّجْعَىٰ " +
                " أَرَأَيْتَ الَّذِي يَنْهَىٰ " +
                " عَبْدًا إِذَا صَلَّىٰ " +
                " أَرَأَيْتَ إِنْ كَانَ عَلَى الْهُدَىٰ " +
                " أَوْ أَمَرَ بِالتَّقْوَىٰ " +
                " أَرَأَيْتَ إِنْ كَذَّبَ وَتَوَلَّىٰ " +
                " أَلَمْ يَعْلَمْ بِأَنَّ اللَّهَ يَرَىٰ " +
                " كَلَّا لَئِنْ لَمْ يَنْتَهِ لَنَسْفَعًا بِالنَّاصِيَةِ" +
                " نَاصِيَةٍ كَاذِبَةٍ خَاطِئَةٍ ﴿16﴾ فَلْيَدْعُ نَادِيَهُ " +
                " سَنَدْعُ الزَّبَانِيَةَ  كَلَّا لَا تُطِعْهُ وَاسْجُدْ وَاقْتَرِبْ  َ"
    }
    val text: LiveData<String> = _text
}